
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>路由器 / OpenWrt · tinc 简明教程 （TincCookbook）</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="Chanix">
        
        
    
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-mermaid-gb3/mermaid/mermaid.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    


    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="../advanced/advanced.html" />
    
    
    <link rel="prev" href="HowToInstallTincOnMacOSMojave.md" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    介绍 / 作者序
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../Introduction/">
            
                <a href="../Introduction/">
            
                    
                    tinc 简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../basic/">
            
                <a href="../basic/">
            
                    
                    基础使用
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="./">
            
                <a href="./">
            
                    
                    组网实例
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="1-HowToInstallTincOnUbuntu1604.html">
            
                <a href="1-HowToInstallTincOnUbuntu1604.html">
            
                    
                    1. 核心主机 / Ubuntu 16.04
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="2-HowToInstallTincOnUbuntu1804.html">
            
                <a href="2-HowToInstallTincOnUbuntu1804.html">
            
                    
                    2. 台式机 / Ubuntu 18.04
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.3" data-path="3-HowToInstallTincOnWin10.html">
            
                <a href="3-HowToInstallTincOnWin10.html">
            
                    
                    3. 笔记本 / Win10
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.4" data-path="HowToInstallTincOnMacOSMojave.md">
            
                <span>
            
                    
                    开发机 / MacOS mojave
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.4.5" data-path="HowToInstallTincOnOpenWrt.html">
            
                <a href="HowToInstallTincOnOpenWrt.html">
            
                    
                    路由器 / OpenWrt
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="../advanced/advanced.html">
            
                <a href="../advanced/advanced.html">
            
                    
                    进阶
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="../theend/theend.html">
            
                <a href="../theend/theend.html">
            
                    
                    结束语
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >路由器 / OpenWrt</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7EC4;&#x7F51;&#x5B9E;&#x4F8B;">&#x7EC4;&#x7F51;&#x5B9E;&#x4F8B;</h1>
<p>&#x4E0A;&#x9762;&#x8BF4;&#x4E86;&#x5F88;&#x591A;&#x7406;&#x8BBA;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x4EFB;&#x4F55;&#x8BF4;&#x6559;&#x90FD;&#x6BD4;&#x4E0D;&#x4E0A;&#x5B9E;&#x8DF5;&#x3002;&#x4E0B;&#x9762;&#x7ED3;&#x5408;&#x5B9E;&#x4F8B;&#xFF0C;&#x8DDF;&#x6211;&#x4E00;&#x8D77;&#x7EC4;&#x5EFA;&#x5C5E;&#x4E8E;&#x81EA;&#x5DF1;&#x7684;tinc&#x7F51;&#x7EDC;&#x3002;
&#x8FD9;&#x662F;&#x4F5C;&#x8005;&#x65E5;&#x5E38;&#x4F7F;&#x7528;&#x7684;tinc&#x7F51;&#x7EDC;&#x3002;&#x8BE6;&#x7EC6;&#x8BF4;&#x660E;&#x4E86;&#x4F5C;&#x8005;&#x662F;&#x5982;&#x4F55;&#x5F00;&#x59CB;&#x8BBE;&#x8BA1;&#x548C;&#x642D;&#x5EFA;&#x4E00;&#x4E2A;tinc&#x7F51;&#x7EDC;&#x3002;&#x5305;&#x62EC;&#x4E86;&#x76EE;&#x524D;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x7684;&#x5927;&#x591A;&#x6570;&#x7F51;&#x7EDC;&#x73AF;&#x5883;&#x548C;&#x5E94;&#x7528;&#x573A;&#x666F;&#xFF0C;&#x76EE;&#x524D;&#x5DF2;&#x7ECF;&#x7A33;&#x5B9A;&#x8FD0;&#x884C;&#x4E86;&#x8D85;&#x8FC7;3&#x5E74;&#x3002;&#x8BFB;&#x8005;&#x53EF;&#x4EE5;&#x6309;&#x7167;&#x81EA;&#x5DF1;&#x7684;&#x9700;&#x8981;&#xFF0C;&#x4ECE;&#x4E2D;&#x622A;&#x53D6;&#x4E00;&#x90E8;&#x5206;&#x3002;</p>
<h2 id="&#x7F51;&#x7EDC;&#x89C4;&#x5212;">&#x7F51;&#x7EDC;&#x89C4;&#x5212;</h2>
<p>&#x52A0;&#x5165;VPN&#x7684;&#x6BCF;&#x53F0;&#x4E3B;&#x673A;&#x4E0A;&#xFF0C;&#x90FD;&#x9700;&#x8981;&#x8FD0;&#x884C;tinc&#xFF0C;&#x6240;&#x4EE5;&#x60A8;&#x5FC5;&#x987B;&#x6709;&#x5BF9;&#x76EE;&#x6807;&#x4E3B;&#x673A;&#x7684;&#x64CD;&#x4F5C;&#x6743;&#x9650;&#xFF1B;</p>
<p>tinc &#x901A;&#x8FC7;connectTo&#x5230;&#x4E3B;&#x673A;&#xFF0C;&#x51FA;&#x4E8E;&#x52A0;&#x5BC6;&#x8BA4;&#x8BC1;&#x7684;&#x9700;&#x8981;&#xFF0C;&#x9700;&#x8981;&#x6709;&#x5BF9;&#x65B9;&#x4E3B;&#x673A;&#x7684;&#x63CF;&#x8FF0;&#x6587;&#x4EF6;&#xFF1B;</p>
<p>tinc &#x662F;&#x5206;&#x5E03;&#x5F0F;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x7EF4;&#x62A4;&#x4E3B;&#x673A;&#x63CF;&#x8FF0;&#x6587;&#x4EF6;&#x8FD8;&#x662F;&#x96C6;&#x4E2D;&#x8D77;&#x6765;&#x6BD4;&#x8F83;&#x597D;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x8BBE;&#x7F6E;&#x4E86;&#x4E00;&#x4E2A;&#x6838;&#x5FC3;&#x4E3B;&#x673A;&#xFF0C;&#x8FD9;&#x53F0;&#x4E3B;&#x673A;&#x4E0A;&#x4FDD;&#x5B58;&#x6240;&#x6709;&#x4E3B;&#x673A;&#x7684;&#x63CF;&#x8FF0;&#x6587;&#x4EF6;&#x3002;&#x5176;&#x4ED6;&#x4E3B;&#x673A;&#x4EC5;&#x9700;&#x8981;&#x6709;&#x672C;&#x8EAB;&#x548C;&#x8FD9;&#x53F0;&#x6838;&#x5FC3;&#x4E3B;&#x673A;&#x7684;&#x63CF;&#x8FF0;&#x6587;&#x4EF6;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#x3002;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x96C6;&#x4E2D;&#x5F0F;&#x7684;&#x7BA1;&#x7406;&#xFF0C;&#x964D;&#x4F4E;&#x7EF4;&#x62A4;&#x91CF;&#x3002;&#x589E;&#x52A0;&#x6216;&#x8005;&#x5220;&#x9664;&#x4E3B;&#x673A;&#x53EA;&#x9700;&#x8981;&#x5728;&#x8FD9;&#x53F0;&#x6838;&#x5FC3;&#x4E3B;&#x673A;&#x4E0A;&#x8FDB;&#x884C;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#x3002;&#x4E3B;&#x673A;&#x53EF;&#x4EE5;&#x5728;&#x8FD0;&#x884C;&#x671F;&#x95F4;&#xFF0C;&#x81EA;&#x52A8;&#x53D1;&#x73B0;&#x548C;&#x4EA4;&#x6362;&#x5176;&#x4ED6;&#x4E3B;&#x673A;&#x7684;&#x63CF;&#x8FF0;&#x4FE1;&#x606F;&#x3002;</p>
<p>&#x6211;&#x4F7F;&#x7528;&#x7684;&#x5E73;&#x53F0;&#x6BD4;&#x8F83;&#x6742;&#xFF0C;&#x4E0D;&#x7528;&#x770B;&#x5168;&#x90E8;&#xFF0C;&#x6311;&#x81EA;&#x5DF1;&#x7528;&#x7684;&#x5C31;&#x597D;&#x4E86;&#x3002;</p>
<p>&#x5C3D;&#x91CF;&#x9075;&#x5FAA;&#x4E0D;&#x4FB5;&#x5165;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x5C3D;&#x91CF;&#x5C11;&#x7684;&#x7BA1;&#x7406;&#x548C;&#x5C3D;&#x91CF;&#x5C11;&#x81EA;&#x52A8;&#x5316;&#x7684;&#x64CD;&#x4F5C;&#x3002;&#x8FD9;&#x6837;&#x964D;&#x4F4E;&#x96BE;&#x5EA6;&#xFF0C;&#x6BD4;&#x8F83;&#x65B9;&#x4FBF;&#x4E00;&#x70B9;&#x3002;</p>
<p>&#x5F00;&#x673A;&#x5C31;&#x81EA;&#x52A8;&#x8FDE;&#x4E0A;&#xFF0C;&#x6BCF;&#x6B21;&#x53BB;&#x70B9;&#x5F88;&#x9EBB;&#x70E6;&#xFF0C;&#x5C3D;&#x91CF;&#x5C11;&#x64CD;&#x4F5C;&#xFF1B;</p>
<p>&#x666E;&#x901A;&#x7684;&#x4F7F;&#x7528;&#xFF0C;&#x7528; router &#x6A21;&#x5F0F;&#x5373;&#x53EF;&#x3002;</p>
<p>&#x6211;&#x7684;&#x7F51;&#x7EDC;&#x89C4;&#x5212;&#x548C;&#x914D;&#x7F6E;&#x5982;&#x4E0B;&#xFF0C;&#x7BAD;&#x5934;&#x8868;&#x793A; ConnectTo &#x65B9;&#x5411;&#x3002;&#x57FA;&#x672C;&#x4E0A;&#x5E38;&#x89C1;&#x7684;&#x7F51;&#x7EDC;&#x73AF;&#x5883;&#x90FD;&#x6709;&#x4E86;&#xFF0C;&#x8BFB;&#x8005;&#x53EF;&#x4EE5;&#x6309;&#x7167;&#x987A;&#x5E8F;&#x6765;&#x8BFB;&#xFF0C;&#x6216;&#x8005;&#x76F4;&#x63A5;&#x8DF3;&#x5230;&#x5BF9;&#x5E94;&#x7684;&#x7AE0;&#x8282;&#x622A;&#x53D6;&#x9700;&#x8981;&#x7684;&#x7F51;&#x7EDC;&#x90E8;&#x5206;&#x5373;&#x53EF;&#x3002;&#x6211;&#x60F3;&#xFF0C;&#x6211;&#x8FD9;&#x4E2A;&#x73AF;&#x5883;&#x8986;&#x76D6;&#x4E86;90%&#x7684;&#x4F7F;&#x7528;&#x573A;&#x666F;&#xFF0C;&#x4F9D;&#x846B;&#x82A6;&#x753B;&#x74E2;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#x3002;</p>
<p>&#x7A33;&#x5B9A;&#x4F18;&#x5148;&#xFF0C;&#x53EF;&#x4EE5;&#x63A5;&#x53D7;&#x4E00;&#x5B9A;&#x7684;&#x6210;&#x672C;&#xFF0C;&#x4F46;&#x8981;&#x5C3D;&#x53EF;&#x80FD;&#x7684;&#x964D;&#x4F4E;&#x3002;</p>
<p>tinc&#x652F;&#x6301;&#x591A;&#x79CD;&#x6A21;&#x5F0F;&#xFF0C;&#x4E0A;&#x8FF0;&#x6709;&#x3002;&#x4F7F;&#x7528;&#x7528;&#x4EA4;&#x6362;&#x673A;&#x6A21;&#x5F0F;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;&#x591A;&#x4E2A;&#x4EE5;&#x592A;&#x7F51;&#x6BB5;&#x8FDE;&#x6210;&#x4E00;&#x4E2A;&#x4EE5;&#x592A;&#x7F51;&#xFF0C;&#x53EF;&#x4EE5;DHCP&#x4EC0;&#x4E48;&#x7684;&#x3002;&#x4F46;&#x9700;&#x8981;&#x8F6C;&#x53D1;&#x5F88;&#x591A;&#x5E7F;&#x64AD;&#x5305;&#xFF0C;&#x6548;&#x7387;&#x4E0A;&#x4E0D;&#x5982;&#x8DEF;&#x7531;&#x5668;&#x6A21;&#x5F0F;&#x3002;&#x5BF9;&#x4E8E;&#x6211;&#x7684;&#x573A;&#x666F;&#x6765;&#x8BF4;&#xFF0C;&#x6CA1;&#x6709;&#x8FD9;&#x4E2A;&#x5FC5;&#x8981;&#xFF0C;&#x800C;&#x4E14;&#x4E3B;&#x673A;&#x5C11;&#xFF0C;&#x624B;&#x5DE5;&#x6307;&#x5B9A;&#x6240;&#x6709;&#x673A;&#x5668;&#x7684;IP&#x914D;&#x7F6E;&#x5E76;&#x4E0D;&#x9EBB;&#x70E6;&#xFF0C;&#x800C;&#x4E14;&#x8FD9;&#x6837;&#x6BD4;&#x8F83;&#x53EF;&#x63A7;&#xFF0C;&#x901A;&#x8BAF;&#x62A5;&#x6587;&#x548C;&#x6548;&#x7387;&#x90FD;&#x6BD4;&#x8F83;&#x9AD8;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x9009;&#x62E9;&#x9ED8;&#x8BA4;&#x7684; router &#x8DEF;&#x7531;&#x6A21;&#x5F0F;&#x3002;</p>
<p>Tinc &#x6709;&#x4E24;&#x4E2A;&#x5927;&#x7248;&#x672C;&#x3002;1.0&#x4E3A;&#x7A33;&#x5B9A;&#x7248;&#xFF0C;1.1&#x5F00;&#x53D1;&#x7248;&#x3002;&#x6838;&#x5FC3;&#x529F;&#x80FD;1.0&#x7248;&#x90FD;&#x6709;&#x4E86;&#xFF0C;&#x5177;&#x4F53;&#x7684;&#x5DEE;&#x522B;&#x53C2;&#x89C1;&#x5B98;&#x7F51;&#x3002;&#x672C;&#x7740;&#x751F;&#x4EA7;&#x7CFB;&#x7EDF;&#x7A33;&#x5B9A;&#x4F18;&#x5148;&#x539F;&#x5219;&#xFF0C;&#x9009;&#x62E9;1.0&#x7248;&#x3002;</p>
<p>0&#x3001;&#x6700;&#x7EC8;&#x7684;&#x7F51;&#x7EDC;&#x793A;&#x610F;&#x56FE;&#xFF0C;&#x57FA;&#x672C;&#x4E0A;&#x5E38;&#x89C1;&#x7684;&#x7F51;&#x7EDC;&#x73AF;&#x5883;&#x90FD;&#x6709;&#x4E86;&#xFF0C;&#x8BFB;&#x8005;&#x53EF;&#x4EE5;&#x6309;&#x7167;&#x987A;&#x5E8F;&#x6765;&#x8BFB;&#xFF0C;&#x6216;&#x8005;&#x76F4;&#x63A5;&#x8DF3;&#x5230;&#x5BF9;&#x5E94;&#x7684;&#x7AE0;&#x8282;&#x622A;&#x53D6;&#x9700;&#x8981;&#x7684;&#x7F51;&#x7EDC;&#x90E8;&#x5206;&#x5373;&#x53EF;&#x3002;&#x6211;&#x60F3;&#xFF0C;&#x6211;&#x8FD9;&#x4E2A;&#x73AF;&#x5883;&#x8986;&#x76D6;&#x4E86;90%&#x7684;&#x4F7F;&#x7528;&#x573A;&#x666F;&#xFF0C;&#x8BFB;&#x8005;&#x7167;&#x846B;&#x82A6;&#x753B;&#x74E2;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#x3002;</p>
<div class="mermaid">
graph RL;
L(&#x53F0;&#x5F0F;&#x673A;) --&gt; Z(&#x6838;&#x5FC3;&#x4E3B;&#x673A;);
W(&#x7B14;&#x8BB0;&#x672C;) --&gt; Z;
M(&#x5F00;&#x53D1;&#x673A;) --&gt; Z;
D(NAS) --&gt; Z;
R(&#x8DEF;&#x7531;&#x5668; NAT) --&gt; Z;
I(&#x5BB6;&#x4EBA;&#x8BBE;&#x5907;) --- R;
J(&#x4E34;&#x65F6;&#x8BBF;&#x95EE;&#x8BBE;&#x5907;) --- R;
</div>



<p>1&#x3001;&#x5EFA;&#x7ACB;&#x6838;&#x5FC3;tinc&#x4E3B;&#x673A;</p>
<p>1&#x3001;&#x5B89;&#x88C5;&#x4E00;&#x53F0;&#x6838;&#x5FC3;tinc&#x4E3B;&#x673A;&#x3002;&#x8FD9;&#x53F0;&#x4E3B;&#x673A;&#x9700;&#x8981;&#x5177;&#x6709;&#x516C;&#x7F51;ip&#xFF0C;&#x6253;&#x5F00;tinc&#x4F7F;&#x7528;&#x7684;&#x7AEF;&#x53E3;&#xFF0C;&#x5916;&#x90E8;&#x80FD;&#x76F4;&#x63A5;&#x8BBF;&#x95EE;&#x3002;&#x5BF9;&#x4E8E;tinc&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x5176;&#x4ED6;&#x8BBE;&#x5907;&#x800C;&#x8A00;&#xFF0C;&#x53EA;&#x8981;&#x80FD;&#x4E0A;&#x7F51;&#xFF0C;&#x80FD;&#x8054;&#x901A;&#x8FD9;&#x53F0;&#x6838;&#x5FC3;&#x4E3B;&#x673A;&#x7684;&#x5BF9;&#x5E94;&#x7AEF;&#x53E3;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x8054;&#x901A;tinc&#x7F51;&#x7EDC;&#x3002;&#x6309;&#x4E2A;&#x4EBA;&#x4E60;&#x60EF;&#xFF0C;IP &#x5B9A;&#x4E3A; 10.0.0.254&#xFF0C;C&#x7C7B;&#x7F51;&#x7EDC;&#xFF08;&#x53EF;&#x5BB9;&#x7EB3;255&#x53F0;&#x673A;&#x5668;&#xFF09;&#xFF0C;&#x7F51;&#x7EDC;&#x63A9;&#x7801;&#x4E3A; 255.255.255.0&#xFF0C;CIDR 10.0.0.254/24&#x3002;</p>
<p>&#x53EF;&#x4EE5;&#x8D2D;&#x4E70;&#x4E91;&#x4E3B;&#x673A;VPS &#x6216;&#x8005;&#x5177;&#x6709;&#x516C;&#x7F51;IP&#x7684;&#x5BB6;&#x91CC;&#x7684;&#x8DEF;&#x7531;&#x5668;&#x4E5F;&#x53EF;&#x4EE5;&#x3002;&#x51FA;&#x4E8E;&#x7B80;&#x5355;&#x7A33;&#x5B9A;&#x7684;&#x9700;&#x8981;&#xFF0C;&#x6211;&#x9009;&#x62E9;&#x4E91;&#x4E3B;&#x673A;&#xFF0C;&#x963F;&#x91CC;&#x4E91;&#x3002;</p>
<p>&#x6211;&#x7684;&#x9009;&#x62E9;&#xFF0C;&#x4E70;&#x4E00;&#x53F0;&#x4E91;&#x4E3B;&#x673A;&#x7528;&#x4EE5;&#x8FD0;&#x884C;tinc&#x3002;&#x4E0D;&#x9700;&#x8981;&#x592A;&#x9AD8;&#x7684;&#x914D;&#x7F6E;&#xFF0C;&#x4E2A;&#x4EBA;&#x666E;&#x901A;&#x4F7F;&#x7528;1&#x6838;1GB&#x5185;&#x5B58;20G&#x666E;&#x901A;&#x4E91;&#x76D8;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#x3002;&#x5E26;&#x5BBD;&#x65B9;&#x9762;&#x6309;&#x7167;&#x81EA;&#x5DF1;&#x7684;&#x6D41;&#x91CF;&#x6765;&#x9009;&#x62E9;&#xFF0C;&#x4E00;&#x822C;&#x6709;&#x6309;&#x4F7F;&#x7528;&#x4ED8;&#x8D39;&#x548C;&#x56FA;&#x5B9A;&#x5E26;&#x5BBD;&#x4E24;&#x79CD;&#x6A21;&#x5F0F;&#x3002;&#x6211;&#x559C;&#x6B22;&#x7B80;&#x5355;&#x7684;&#x4ED8;&#x8D39;&#x6A21;&#x5F0F;&#xFF0C;&#x5E26;&#x5BBD;&#x8981;&#x6C42;&#x4E5F;&#x4E0D;&#x5927;&#xFF0C;&#x56E0;&#x6B64;&#x9009;&#x62E9;&#x7684;&#x662F;1M&#x56FA;&#x5B9A;&#x5E26;&#x5BBD;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x914D;&#x7F6E;&#xFF0C;&#x76EE;&#x524D;&#x963F;&#x91CC;&#x4E91;&#x7684;&#x4EF7;&#x683C;&#x662F;&#x4EBA;&#x6C11;&#x5E01;70&#x5DE6;&#x53F3;&#xFF0C;&#x4E00;&#x6B21;&#x6027;&#x65F6;&#x95F4;&#x957F;&#x4E00;&#x70B9;&#x4ED8;&#x8D39;&#x8FD8;&#x6709;&#x4F18;&#x60E0;&#x3002;&#x6211;&#x662F;&#x4E00;&#x6B21;&#x6027;&#x4ED8;&#x4E86;N&#x5E74;&#xFF0C;&#x5DEE;&#x4E0D;&#x591A;&#x6DB5;&#x76D6;&#x4E86;&#x6709;&#x751F;&#x4E4B;&#x5E74;&#x2026;&#x2026;&#x6254;&#x90A3;&#x91CC;&#x6162;&#x6162;&#x7528;&#x5C31;&#x597D;&#x4E86;&#x3002;</p>
<p>&#x963F;&#x91CC;&#x4E91;&#x63D0;&#x4F9B;99%&#x4EE5;&#x4E0A;&#x7684;&#x53EF;&#x9760;&#x6027;&#xFF0C;&#x8D1F;&#x8F7D;&#x4E0D;&#x5927;&#xFF0C;&#x57FA;&#x672C;&#x4E0D;&#x53EF;&#x80FD;&#x51FA;&#x95EE;&#x9898;&#xFF0C;&#x56E0;&#x6B64;&#x4E0D;&#x8003;&#x8651;&#x6838;&#x5FC3;&#x4E3B;&#x673A;&#x7684;&#x5907;&#x4EFD;&#x4E86;&#x3002;&#x7F51;&#x7EDC;&#x51FA;&#x95EE;&#x9898;&#x5FCD;&#x4E00;&#x4E0B;&#x4E0D;&#x662F;&#x4EC0;&#x4E48;&#x5927;&#x4E8B;&#xFF0C;&#x4E3B;&#x673A;&#x51FA;&#x4E86;&#x95EE;&#x9898;&#xFF0C;&#x53EA;&#x8981;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x5907;&#x4EFD;&#x597D;&#x4E86;&#xFF0C;&#x91CD;&#x65B0;&#x5B89;&#x88C5;&#x4E5F;&#x5C31;&#x662F;&#x534A;&#x5C0F;&#x65F6;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x53C8;&#x4E0D;&#x662F;&#x4EC0;&#x4E48;&#x5927;&#x4E0D;&#x4E86;&#x7684;&#x73AF;&#x5883;&#xFF0C;&#x6740;&#x9E21;&#x4E0D;&#x7528;&#x725B;&#x5200;&#x3002;</p>
<p>&#x5B89;&#x88C5;&#xFF1A;</p>
<p>sudo apt-get install tinc -y</p>
<p>ubuntu &#x7684;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x5939;&#x4E3A;   /etc/tinc</p>
<p>&#x751F;&#x6210;&#x914D;&#x7F6E;&#x6587;&#x4EF6;</p>
<p>&#x751F;&#x6210;&#x79D8;&#x94A5;</p>
<p>&#x914D;&#x7F6E;&#x4E3A;&#x9ED8;&#x8BA4;&#x8FD0;&#x884C;</p>
<p>/etc/tinc/nets.boot</p>
<p>&#x7136;&#x540E;&#x91CD;&#x65B0;&#x542F;&#x52A8; </p>
<p>sudo reboot</p>
<p>2&#x3001;&#x914D;&#x7F6E;&#x5E38;&#x7528;&#x64CD;&#x4F5C;&#x673A;&#x5668;&#xFF08;win10&#xFF09;</p>
<p>&#x5148;&#x5B89;&#x88C5;&#x9A71;&#x52A8;</p>
<p>&#x7136;&#x540E;&#x590D;&#x5236;&#x5C31;&#x597D;&#x4E86;&#x3002;</p>
<p>&#x540C;&#x6837;&#x7684; &#x914D;&#x7F6E;</p>
<p>&#x672C;&#x673A;&#x542F;&#x52A8;tinc</p>
<p>&#x7136;&#x540E;&#x8BB0;&#x5F97;hosts&#x91CC;&#x9762;&#x52A0;&#x4E0A;&#x6838;&#x5FC3;&#x673A;&#x5668;&#x7684;&#x63CF;&#x8FF0;&#x6587;&#x4EF6;</p>
<p>&#x7136;&#x540E;&#x5C06;&#x672C;&#x673A;&#x7684;&#x63CF;&#x8FF0;&#x6587;&#x4EF6;&#x590D;&#x5236;&#x5230; &#x6838;&#x5FC3;&#x673A;&#x5668;&#x4E0A;</p>
<p>&#x7B49;&#x4E00;&#x4E0B;&#xFF0C;&#x6216;&#x8005;&#x91CD;&#x65B0;&#x542F;&#x52A8; service tinc restart</p>
<p>&#x7136;&#x540E; ping &#x2026;&#x2026;</p>
<p>&#x641E;&#x5B9A;&#x4E86;&#x3002;</p>
<p>3&#x3001;&#x914D;&#x7F6E;&#x5E38;&#x7528;&#x5F00;&#x53D1;&#x673A;&#xFF08;mac&#xFF09;</p>
<p>4&#x3001;&#x914D;&#x7F6E;&#x5E38;&#x7528;&#x6D4B;&#x8BD5;&#x673A;&#xFF08;LINUX&#xFF09;</p>
<p>5&#x3001;&#x914D;&#x7F6E;&#x865A;&#x62DF;&#x673A;&#xFF08;virtualbox&#x7B49;&#xFF09;</p>
<p>6&#x3001;&#x914D;&#x7F6E;&#x8DEF;&#x7531;&#x5668;&#xFF08;openwrt&#xFF09;</p>
<p>7&#x3001;&#x914D;&#x7F6E;&#x963F;&#x91CC;&#x4E91;&#x4E13;&#x6709;&#x7F51;&#x7EDC;&#xFF0C;&#x4EC5;&#x6709;&#x5185;&#x7F51;IP&#x7684;&#x673A;&#x5668;</p>
<p>8&#x3001;&#x914D;&#x7F6E;&#x5B89;&#x5353;&#x624B;&#x673A;</p>
<p>9&#x3001;&#x914D;&#x7F6E;&#x82F9;&#x679C;&#x624B;&#x673A;</p>
<p>10&#x3001;&#x5E38;&#x7528;&#x4FBF;&#x643A;&#x8BBE;&#x5907;&#xFF08;&#x4FBF;&#x643A;&#x8DEF;&#x7531;&#xFF09;</p>
<div class="mermaid">
graph LR;
A(&#x5149;&#x7EA4;&#x8DEF;&#x7531;&#x5668;) --&gt; B(NETGEAR);
B --&gt; C(IPTV &#x673A;&#x9876;&#x76D2;);
B --&gt; D(&#x5176;&#x4ED6;&#x8BBE;&#x5907;);
</div>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="HowToInstallTincOnMacOSMojave.md" class="navigation navigation-prev " aria-label="Previous page: 开发机 / MacOS mojave">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="../advanced/advanced.html" class="navigation navigation-next " aria-label="Next page: 进阶">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"路由器 / OpenWrt","level":"1.4.5","depth":2,"next":{"title":"进阶","level":"1.5","depth":1,"path":"advanced/advanced.md","ref":"advanced/advanced.md","articles":[]},"previous":{"title":"开发机 / MacOS mojave","level":"1.4.4","depth":2,"path":"examples/HowToInstallTincOnMacOSMojave.md","ref":"examples/HowToInstallTincOnMacOSMojave.md","articles":[]},"dir":"ltr"},"config":{"plugins":["mermaid-gb3"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"mermaid-gb3":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"Chanix","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"tinc 简明教程 （TincCookbook）","language":"zh-hans","gitbook":"*"},"file":{"path":"examples/HowToInstallTincOnOpenWrt.md","mtime":"2019-03-26T04:47:46.056Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-03-27T02:18:31.658Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-mermaid-gb3/book/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    <script src="../gitbook/gitbook-plugin-mermaid-gb3/mermaid/mermaid.min.js"></script>

    </body>
</html>

